load-tests/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 100  # 100 requests per second
  http:
    timeout: 5
    pool: 'keep-alive'

scenarios:
  - flow:
      - post:
          url: '/api/users/register'
          json:
            email: "test@example.com"
            password: "password"
            name: "Test User"
      - post:
          url: '/api/users/login'
          json:
            email: "test@example.com"
            password: "password"
          capture:
            - json: "$.token"  # Capture the token from the login response
              as: "authToken"   # Store it in a variable called authToken
      - post:
          url: '/api/donations'
          json:
            donorId: "donorIdHere"
            beneficiaryId: "beneficiaryIdHere"
            amount: 10
          headers:
            Authorization: "Bearer {{ authToken }}"  # Use the captured token
      - get:
          url: '/api/donations/count/donorIdHere'
          headers:
            Authorization: "Bearer {{ authToken }}"  # Use the captured token
      - get:
          url: '/api/donations/period/donorIdHere?startDate=2023-01-01&endDate=2023-12-31&page=1&limit=10'
          headers:
            Authorization: "Bearer {{ authToken }}"  # Use the captured token